[metadata]
creation_date = "2026/03/27"
integration = []
maturity = "development"
updated_date = "2026/03/27"

[rule]
actions = []
author = ["customer"]
description = "This is a rule as code"
enabled = false
exceptions_list = []
false_positives = []
from = "now-6m"
interval = "5m"
language = "kuery"
max_signals = 100
name = "rule from code"
references = []
related_integrations = []
risk_score = 20
risk_score_mapping = []
rule_id = "f15f9d04-a7b7-4790-a7cc-eedd67ef7313"
setup = ""
severity = "low"
severity_mapping = []
tags = []
threat = []
to = "now"
type = "query"

query = '''
host.hostname: *
'''


[[rule.required_fields]]
ecs = true
name = "host.hostname"
type = "keyword"


