[metadata]
creation_date = "2026/03/27"
integration = []
maturity = "development"
updated_date = "2026/03/27"

[rule]
actions = []
author = ["customer"]
description = "This is a rule from Kibana"
enabled = false
exceptions_list = []
false_positives = []
filters = []
from = "now-6m"
index = ["logs-*"]
interval = "5m"
language = "kuery"
license = ""
max_signals = 100
name = "rule from Kibana"
references = []
related_integrations = []
risk_score = 20
risk_score_mapping = []
rule_id = "43e95de2-2718-4b11-91fc-02e581b47367"
setup = ""
severity = "low"
severity_mapping = []
tags = []
threat = []
to = "now"
type = "query"

query = '''
host.hostname: *
'''


[[rule.required_fields]]
ecs = true
name = "host.hostname"
type = "keyword"

[rule.alert_suppression]
group_by = ["host.hostname"]
missing_fields_strategy = "suppress"

[rule.meta]
kibana_siem_app_url = ""

